cats/app/views/cat_rental_requests/new.html.erb

<form action="<%=cat_rental_requests_url %>" method="post">
<% cats = Cat.all %>
---
SELECT "cats".* FROM "cats"