cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    cat = Cat.new(cat_params)
    debugger
    if cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Bob"], ["updated_at", "2018-11-13 22:58:36.378891"], ["id", 3]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)