cats/app/views/cats/show.html.erb

<h2>Existing Requests!</h2>
<% requests = CatRentalRequest.where(cat_id: @cat.id) %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 3]]